CSI API ETABS v1
cAreaObj.GetPoints Method
 Retrieves the names of the point objects that define an area object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPoints(
	string Name,
	ref int NumberPoints,
	ref string[] Point
)
Function GetPoints (
	Name As String,
	ByRef NumberPoints As Integer,
	ByRef Point As String()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberPoints As Integer
Dim Point As String()
Dim returnValue As Integer
returnValue = instance.GetPoints(Name,
	NumberPoints, Point)
int GetPoints(
	String^ Name,
	int% NumberPoints,
	array<String^>^% Point
)
abstract GetPoints :
        Name : string *
        NumberPoints : int byref *
        Point : string[] byref -> int
Parameters
Name
Type: System.String
 The name of a defined area object.
NumberPoints
Type: System.Int32
 The number of point objects that define the area object.
Point
Type: System.String[]
Return Value
Type: Int32
 Returns zero if the point object names are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberPoints As Integer
   Dim point() As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get names of points
   ret = SapModel.AreaObj.GetPoints("1", NumberPoints, Point)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace